# Area Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaLoad..::..Area Property
AreaLoad Class See Also
---
Returns area of the area load.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double Area { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Area As Double
	Get
```

Visual C++
---
```text
public:
property double Area {
	double get ();
}
```

# See Also
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace